app/controllers/api/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.user_id = current_user.id
        if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 30], ["post_id", 100], ["body", "hello"], ["created_at", "2022-08-18 16:19:07.292433"], ["updated_at", "2022-08-18 16:19:07.292433"]]

    def update
        @comment = Comment.find_by(id: params[:id])
        if @comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "hello world"], ["updated_at", "2022-08-18 16:21:21.616532"], ["id", 3]]

    def destroy
        @comment = Comment.find_by(id: params[:id])
        if @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]