app/controllers/api/likes_controller.rb

SELECT "likes".* FROM "likes"
---
    def index
        @likes = Like.all

INSERT INTO "likes" ("user_id", "likeable_id", "likeable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["likeable_id", 123], ["likeable_type", "Post"], ["created_at", "2022-08-19 20:49:31.111182"], ["updated_at", "2022-08-19 20:49:31.111182"]]
---
    def create
        @like = Like.new(like_params)
        @like.user_id = current_user.id if current_user
        if @like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
    def destroy
        @like = Like.find_by(id: params[:id])
        if @like.destroy