app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 29], ["body", "hello world"], ["created_at", "2022-08-17 16:42:46.269036"], ["updated_at", "2022-08-17 16:42:46.269036"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
    def destroy
        @post = Post.find_by(id: params[:id])
        # @post.user_id = current_user.id
        if @post && @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "tessey "], ["updated_at", "2022-08-17 17:51:40.615734"], ["id", 17]]
---
    def update
        @post = Post.find_by(id: params[:id])
        if @post.update(post_params)